agrondpham/lpc1764-sdcard/trunk/KHNLPC1764/src/main.c
}
void UART0_IRQHandler(void) {
	uint8_t IIRValue, LSRValue;
	uint8_t data;
	unsigned char trangthai_gui;
	IIRValue = LPC_UART0 ->IIR;
	IIRValue >>= 1; /* skip pending bit in IIR */
	IIRValue &= 0x07; /* check bit 1~3, interrupt identification */
	if (IIRValue == IIR_RLS) /* Receive Line Status */
	{
		LSRValue = LPC_UART0 ->LSR;
		if (LSRValue & LSR_RDR) /* Receive Data Ready */
		{
			data = LPC_UART0 ->RBR;
			//UART2_Sendchar(temp);
		}
	} else if (IIRValue == IIR_RDA) /* Receive Data Available */
	{
		//sprintf(tempValue,";%d",flag_gprs.send_gprs_ok);
		//UART2_PrintString(tempValue);

		data = LPC_UART0 ->RBR;
#if _DEBUG==1
		UART2_Sendchar(data);
		UART3_Sendchar(data);
#endif
		if (data == 0x0A) {
			if (flag_system.start_rx_gsm == 2) {
				rx_buffer0[rx_gsm_index] = NULL;
				process_gsm_data();
				rx_gsm_index = 0;
				flag_system.start_rx_gsm = 0;
			} else if (rx_gsm_index == 0)
				flag_system.start_rx_gsm = 1;
			else if (rx_buffer0[0] == '+' && rx_buffer0[1] == 'C'
					&& rx_buffer0[2] == 'M' && rx_buffer0[3] == 'G'
					&& rx_buffer0[4] == 'R')
				flag_system.start_rx_gsm = 2;
			else {
				rx_buffer0[rx_gsm_index] = NULL;
				if (rx_buffer0[0] != NULL ) {
					process_gsm_data();
					rx_gsm_index = 0;
					flag_system.start_rx_gsm = 0;
				} else {
					flag_system.start_rx_gsm = 1;
				}
			}

		} else if (flag_system.start_rx_gsm != 0 && data != 0x0D) {
			rx_buffer0[rx_gsm_index] = data;
			if (++rx_gsm_index >= gsm_bufferLen) {
				rx_gsm_index = 0;
				process_gsm_data();
				flag_system.start_rx_gsm = 0;
			}
		}

	}

}

void UART1_IRQHandler(void) {
	uint8_t IIRValue, LSRValue;
	uint8_t data;
	IIRValue = LPC_UART1 ->IIR;
	IIRValue >>= 1; /* skip pending bit in IIR */
	IIRValue &= 0x07; /* check bit 1~3, interrupt identification */
	if (IIRValue == IIR_RLS) /* Receive Line Status */
	{
		LSRValue = LPC_UART1 ->LSR;
		if (LSRValue & LSR_RDR) /* Receive Data Ready */
		{
			data = LPC_UART1 ->RBR;
			//UART2_Sendchar(temp);
		}
	} else if (IIRValue == IIR_RDA) /* Receive Data Available */
	{
		data = LPC_UART1 ->RBR;
		//UART2_PrintString("?");
		if (flag_system.request_data) {
			if (data == '$') {
				flag_system.start_rx_gps = 1;
			} else if (data == '*') // && flag_system.start_rx_gps
					{
				flag_system.start_rx_gps = 0;
				rx_buffer1[rx_wr_index1] = NULL;

				if (rx_buffer1[0] == 'G' && rx_buffer1[1] == 'P'
						&& rx_buffer1[2] == 'R' && rx_buffer1[3] == 'M'
						&& rx_buffer1[4] == 'C') {

					process_gps_data();

				}
				del_buffer(gps);
			} else if (flag_system.start_rx_gps == 1) {
				rx_buffer1[rx_wr_index1] = data;
				if (++rx_wr_index1 > RX_BUFFER_SIZE1) {
					rx_wr_index1 = 0;
					flag_system.start_rx_gps = 0;

				}
//               if (++rx_counter1 == RX_BUFFER_SIZE1)
//                  {
//                  rx_counter1=0;
//                  rx_buffer_overflow1=1;
//                  };

			}

		}

	}
}

void TIMER0_IRQHandler(void) {
//
//    /* Set new timer interrupt, toggle led status and write value to the led port */
	uint8_t var_key, var_door;
	TIMER0_interrupt();
//	couter0++;
//	if (couter0 > 6) {
//		couter0 = 0;
//		toggle = ~toggle;
//		//GPIOSetValue(BUZZER, toggle);
//		//LPC_TIM0->IR = 1;			/* clear interrupt flag */
//	}

//    toggle = ~toggle;
//    GPIOSetValue(BUZZER, toggle);
//
	var_key = GPIOGetValue(KEY_IN);      //Read the button value
	var_door = GPIOGetValue(DOOR_IN);
	if (var_key == 0)      //KEY_IN
			{
		// GPIOSetValue(BUZZER, HIGH);
		flag_system.status_key = 2;
	} else {
		//GPIOSetValue(BUZZER, LOW);
		flag_system.status_key = 1;
	}
	if (var_door == 0)      //KEY_IN
			{
		//GPIOSetValue(BUZZER, HIGH);
		flag_system.status_door = 2;
	} else {
		//GPIOSetValue(BUZZER, LOW);
		flag_system.status_door = 1;
	}

}

void TIMER1_IRQHandler(void) {
//
//    /* Set new timer interrupt, toggle led status and write value to the led port */
	TIMER1_interrupt();
	couter0++;
	if (couter0 > 6) {
		couter0 = 0;
		toggle = ~toggle;
		//GPIOSetValue(BUZZER, toggle);
		//LPC_TIM0->IR = 1;			/* clear interrupt flag */
	}
//	toggle = ~toggle;
//	GPIOSetValue(BUZZER, toggle);

//    toggle = ~toggle;
//    GPIOSetValue(BUZZER, toggle);
}

///start EEPROM
//int writeFlash(char* data) {
//void writeFlash(char* data) {
//	int x;
//	unsigned char src_buffer[256];
//	if (u32IAP_PrepareSectors(17, 17) == IAP_STA_CMD_SUCCESS) {
//		/*	Copy data from RAM to Flash, number of bytes to be written should be 256|512|1024|4096 */
//		memset(src_buffer, 0, 256); //zero init src buffer
//		for (x = 0; x < 256; x++) {
//			src_buffer[x] = data[x]; // copy phone_1 into 256 bytes buffer
//		}
//		u32IAP_CopyRAMToFlash(DATA_START_SECTOR, (uint32_t)&src_buffer, sizeof(src_buffer));
////		if (u32IAP_CopyRAMToFlash(DATA_START_SECTOR, (uint32_t) &src_buffer,
////				sizeof(src_buffer)) == IAP_STA_CMD_SUCCESS) {
////			return 1;
////		} else {
////			return 0;
////		}
//	}
//
//}

//void clearFlash() {
//
//	u32IAP_EraseSectors(17, 17) == IAP_STA_CMD_SUCCESS;
//	delay_ms(100);
//	u32IAP_PrepareSectors(17, 17) == IAP_STA_CMD_SUCCESS;
//
////	if (u32IAP_PrepareSectors(17, 17) == IAP_STA_CMD_SUCCESS) {
////		if (u32IAP_EraseSectors(17, 17) == IAP_STA_CMD_SUCCESS) {
////			return 1;
////		} else {
////			return 0;
////		}
////	}
//
//}

//void CopyRAMToFlash(char* phone_save) {
//	int x;
//	//char* fone="0934131426";
//	//delay_ms(3000);
//	if (u32IAP_PrepareSectors(17, 17) == IAP_STA_CMD_SUCCESS) {
//		/*	Copy data from RAM to Flash, number of bytes to be written should be 256|512|1024|4096 */
//		unsigned char src_buffer[256]; // at least 256 bytes buffer to write into flash
//		memset(src_buffer, 0, 256); //zero init src buffer
//		for (x = 0; x < 256; x++) {
//			src_buffer[x] = phone_save[x]; // copy phone_1 into 256 bytes buffer
//		}
//		u32IAP_CopyRAMToFlash(DATA_START_SECTOR, (uint32_t) &src_buffer, 256); //sizeof(phone_1));
//	}
//	//UART2_PrintString("coppy_run \r\n");
//	/* Read back data from Flash */
//	//unsigned char phone_2[256];
//	//memcpy(phone_2, (void*)0x00018000,256);
//}

void EraseSectors() {
	if (u32IAP_EraseSectors(17, 17) == IAP_STA_CMD_SUCCESS) {
		UART2_PrintString("clear successful \r\n");
	} else {
		UART2_PrintString("clear unsuccessful \r\n");
	}
	if (u32IAP_PrepareSectors(17, 17) == IAP_STA_CMD_SUCCESS)
		UART2_PrintString("clear end \r\n");
}

