agrondpham/lpc1764-sdcard/trunk/KHNLPC1764/src/main.c
//////END

void upload_info() {
	unsigned char x, j;
	unsigned char phone_2[256];
	memcpy(phone_2, (void*) 0x00018000, 256);
	delay_ms(100);
	for (x = 0; x < phoneLen; x++) {
		if (phone_2[x] == NULL || phone_2[x] == 0xFF)
			break;
		if (phone_2[x] > 0x39 || phone_2[x] < 0x30)
			break;
		phone_1[x] = phone_2[x];
	}
	phone_1[x] = NULL;
	if (phone_1[0] == NULL || phone_1[0] == 0xF)
		sprintf(phone_1, "000");
//// start phoneDrive
	for (j = 0; j < phoneLen; j++) {
		if (phone_1[j] == NULL || phone_1[j] == 0xFF)
			break;
		phoneDrive[j] = phone_1[j];
	}
	phoneDrive[j] = NULL;
	///end
	if (apn[0] == NULL || apn[0] == 0xff) {
//		sprintf(apn, "v-internet");
//		sprintf(userName, "");
//		sprintf(passApn, "");
		sprintf(apn, "m3-world");
		sprintf(userName, "mms");
		sprintf(passApn, "mms");
	}
	if (ipServer[0] == NULL || ipServer[0] == 0xff) {
		sprintf(ipServer, "112.213.84.16");
		sprintf(tcpPort, "11511");
	}
	if (timeCheck[0] == NULL || timeCheck[0] == 0xff)
		counter_send_gps = 20;		// gui len server

}

void init_program(void) {
	TimerInit(0, TIMER0_INTERVAL);
	TimerInit(1, TIMER1_INTERVAL);
	enable_timer(0);
	enable_timer(1);
	if (SysTick_Config(SystemCoreClock / 1000)) //{ /* Setup SysTick Timer for 1 msec interrupts  */
			{
		while (1)
			; /* Capture error */
	}

	UART0_Init(9600);
	UART1_Init(9600);
	UART2_Init(9600);
	UART3_Init(9600);
	KHN_SDCARD_INIT();
	LED_Init();
	BUZZER_Init();
	key_init();
	gsm_on();
}
//int main(void) {
//	int x;
//	char* dataCollection;
//	char line[256]="Khanhhoi;0913742108;213432534435;324123412341;0946309067;0913742108;213432534435;324123412341;324123412341";
//	char* printData;
//	UART2_Init(9600);
//	UART2_PrintString("xxxx");
//	//dataCollection = strtok(line, ";");
//
//	get_data_from_flash(line);
//
//	UART2_PrintString(flash_data.company);
//	UART2_PrintString(flash_data.address);
//}

int main(void) {
	uint8_t location;
	uint8_t buffer[200];

	uint8_t vitri, resend_gprs, counter_init = 0, i;
	unsigned char b, c, d;
	int a;
	char day, month, year, hour, min, sec; //, week_day;

	char hour_tam[3];

	char min_tam[3];
	char sec_tam[3];
	char year_tam[3];
	char month_tam[3];
	char day_tam[3];
	char month_tam_1[3];
	init_program();
//delay_ms(500);
//Init_SomeThing();
//LED_Config();
	delay_ms(500);
	upload_info();
//delay_ms(500);
//start_up_gsm();

//flash_led();

	for (i = 0; i < 5; i++) {
		flash_led();
		delay_ms(1000);
	}
	GPIOSetValue(BUZZER, HIGH);
	delay_ms(50);
	GPIOSetValue(BUZZER, LOW);
	flag_modem.flash_coppy = 1;

//disk_initialize(0);
	while (1) {
		if (flag_modem.modem == not_connect) {
			start_up_gsm();
			///if(flag_modem.flash_coppy == 1)
			//{
			//flag_modem.flash_coppy = 0;
			//CopyRAMToFlash(phone_1);
			//}
			delay_ms(1000);
			init_gsm();
			//UART3_Sendchar('A');
			//UART3_PrintString("ket thuc main vao while");
			if (flag_gprs.status_gprs != ok_status) {

				flag_system.led_check = 1;
				flag_gprs.status_gprs = init_tcp(apn, userName, passApn,
						flag_gprs.status_gprs);
				resend++;
				if (resend >= 2 && flag_gprs.status_gprs != ok_status) {
					flag_gprs.deactive_pdp = 1;
					resend = 0;
				} else if (flag_gprs.status_gprs == ok_status)
					counter_init = 0;
				flag_system.led_check = 0;
			}
		}
		if (flag_modem.modem == connected) {
			if (flag_modem.error == 1)
				flag_modem.modem = not_connect;
			else
				flag_modem.modem = connected;
			if (flag_system.read_sms == 1) {
				UART0_PrintString("AT+CMGR=1\r");
				flag_system.read_sms = 0;
				delay_ms(1000);
			} else if (flag_modem.cmgr == 1) {
				flag_modem.cmgr = 0;
				//clearFlash();
				EraseSectors();
				if (strlen(userCall_new) > 10)
					process_command();
				delay_ms(1000);
				send_sms_func(sms_reply);
				delay_ms(1000);
				UART0_PrintString("AT+CMGDA=\"DEL ALL\"\r");
				flag_system.send_data = 0;
				delay_ms(1000);
				//writeFlash(phone_1);
				write_basic_infor(data_flash);
				//CopyRAMToFlash(phone_1);
				delay_ms(500);
				UART0_PrintString("AT\n\r");
				delay_ms(1000);
				flag_modem.modem = not_connect;
				flag_modem.flash_coppy = 1;

			} else if (flag_system.send_data_flag == smsMode) {
				flag_system.send_data_flag = 0;
				flag_system.send_data = 0;
				send_sms_func(sms_reply);
				delay_ms(1000);
				UART0_PrintString("AT+CMGDA=\"DEL ALL\"\r");
				delay_ms(3000);
			} else if (flag_modem.ring) {
				ring_func();
//			for (i = 0; i < phoneLen; i++) {
//				if (phone_1[i] == NULL || phone_1[i] == 0xFF)
//					break;
//				phoneDrive[i] = phone_1[i];
//			}
//			phoneDrive[i] = NULL;

			}
			if (flag_system.send_data || flag_system.change_status) {

				if (flag_gprs.deactive_pdp) {
					sprintf(buffer, "%c", ESC);
					UART0_PrintString(buffer);
					delay_ms(1000);
					UART0_PrintString("AT+CIPSHUT\r");
					delay_ms(1000);
					if (++counter_init >= 5)    // test
							{
						counter_init = 0;

						start_up_gsm();
						flag_modem.modem = not_connect;
					}
					flag_gprs.deactive_pdp = 0;
					flag_gprs.connect_ok = 0;
					flag_gprs.status_gprs = cstt_error;
				} else if (ipServer[0] != NULL
						&& ipServer[0] != 0xFF&& tcpPort[0] != NULL) // thieu xac nhan cac thong so
								{for (vitri = 0; vitri < strlen(imei); vitri++) // kiem tra thanh phan ky tu trong imei
						{             // dung tam bien vitri de lam bien dem
							if (imei[vitri] < 0x30 || imei[vitri] > 0x39) {
								if (check_imei() == 0) // check lai imei neu thay ok thi bat dau gui
								{
									vitri = 0;      // gan i = 0 de cho gui tiep
								} else
								vitri = 1;    // gan = 1 de stop gui
								break;
							}
						}
						if (vitri == 0 || vitri == strlen(imei)) // neu = 0 thi cho gui vi imei dung
						{
//							sprintf(data_gps,
//									"$%s,56,%s,%s,N,%s,E,%s,%d,%d,%d,%d,%s,%s,%d,%d,%s,%s$\r\n",
//									version, imei, latitude, longitude,
//									speed_gps, oil_value,
//									flag_system.status_door,
//									flag_system.status_key,
//									flag_system.card_status, so_vin, phone_1,
//									flag_system.cold_hot, flag_system.sleep,gps_date_string,
//									gps_time_string);
							// trang thai IN3

//							switch (WriteData(1, 17022014, 160000)) {
//								case 1:
//								break;
//								case 2:
//								break;
//							}
//							f_puts(data_gps, &file);
//#if _DEBUG==1
//								UART2_PrintString("Write sdcard\r\n");
//#endif
//								//f_puts(" The gioi that rong lon\r\n",&file);
//								Close();
//								// sdcard end
//
							if (connectServer(ipServer, tcpPort) == ok_status) {
								flag_gprs.connect_ok = 1;   // ket noi ok

