agrondpham/lpc1764-sdcard/trunk/KHNLPC1764/src/main.c
			//printf("ATu %s\r", data_gps);

			//SDCARD

//		               //  i = init_mmc();
//
//		                   if (!i)
//		                    {
//		                        a = creat_file(time_gps);
//		                        card_detect=1;
//		                        flag_system.card_status=1;
//		                        if (a!=0)
//		                        {
//		                            printf("ATc+%d\r", a);
//		                            delay_ms(1000);
//		                            flag_system.card_status=0;
//		                            card_detect=0;
//		                        }
//		                    }
//		                    else
//		                    {
//		                        card_detect=0;
//		                        printf("AT2+3\r");    // trang thai loi card
//		                        delay_ms(1000);
//		                        flag_system.card_status=0;
//
//		                    }

			///start_sdcar
			switch (WriteData(1, atoi(day_gps_card), a*10000)) {
			case 1:
				break;
			case 2:
				break;
			}
			if (f_puts(data_gps, &file) > -1) {
				Close();
				flag_system.card_status = 1;
#if _DEBUG==1
				UART2_PrintString("write sdcard\r\n");
#endif
			} else {
				flag_system.card_status = 0;
#if _DEBUG==1
				UART2_PrintString("CAN NOT Write sdcard\r\n");

#endif
			}  //END
			   //READ sdcard
//			switch (ReadData(1, 17022014, 160000)) {
//			case 1:
//				break;
//			case 2:
//				break;
//			}
//			char buffer[256];
//			while (f_gets(buffer, sizeof buffer, &file)) {
//				UART2_PrintString(buffer);
//			}
//
//			////////////////END
			exit_write_data: flag_system.write_data = 0;
			timer_send_gps = 0; // xoa thoi gian gui len data va cho ghi vao the nho

			delay_ms(100);
		}
		//////////end

	}
}

//int main(void) {
//	char line[82];
//	InitPort();
//	SystemInit();
//	KHN_SDCARD_INIT();
//	init_timer(TIMER0_INTERVAL);
//	enable_timer( 0 );
//	UART1_Init();	//GPS
//	UART0_Init();	//SIM900D
//	UART2_Init(9600);	//RS232
//	//{COde demo sdcard
//	disk_initialize(0);
//		// This line of code will return Fil data in &file.Data is in Folder 117032014, filename 16110
//		if(ReadData(1,17032014,161100)) return 0;
//		while (f_gets(line, sizeof line, &file)){
//			DebugPrint(line);
//			DebugPrint("\r\n");
//		}
//		//remeber close file
//		Close();
//						//while(1){}
//		switch(WriteData(1,17022014,160000))	{
//		case 1:
//			break;
//		case 2:
//			break;
//		}
//		f_puts("$GSHT,2,xx,<NGUYEN VAN A,AN234343,00:01:29;105.34344,21.34343,21.34343,04:02:13,105.3464433,21.32343,80>,xxx#\r\n",&file);
//		//f_puts(" The gioi that rong lon\r\n",&file);
//		Close();
////}end sdcard demo
//	while (1) {
//		short_delay(1000);
//		Leds_invert();
//		Read232("READ01031214#");
//		Write232(Buff232.type, "abaabbbbcccccc");
//		//UART0_PrintString("AT\r\n");
//	}
//	return 0;
//}

